{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from qwikidata.json_dump import WikidataJsonDump\n",
    "from pprint import pprint\n",
    "from tqdm import tqdm\n",
    "import pandas as pd\n",
    "\n",
    "wjd = WikidataJsonDump('/workdir/important_datasets/wikidata-20220103-all.json.gz')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "source": [
    "from qwikidata.sparql import return_sparql_query_results\n",
    "\n",
    "query_string = \"\"\"\n",
    "SELECT ?WDid\n",
    "WHERE {\n",
    "  ?WDid wdt:P105 wd:Q7432.  # Taxon rank is species\n",
    "  ?WDid wdt:P171 wd:Q756.   # Kingdom is plants\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "results = return_sparql_query_results(query_string)\n",
    "print(len(results['results']['bindings']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Entity: statement/Q497975-23480ba8-23b7-4507-ae17-b7b3d8d00948 (ID: http://www.wikidata.org/entity/statement/Q497975-23480ba8-23b7-4507-ae17-b7b3d8d00948)\n",
      "Property: http://www.wikidata.org/prop/statement/P910 (ID: http://www.wikidata.org/prop/statement/P910)\n",
      "---\n",
      "Entity: https://ar.wikipedia.org/wiki/%D8%AA%D8%B5%D9%86%D9%8A%D9%81:%D8%AB%D9%85%D8%A7%D8%B1_%D8%B5%D8%A7%D9%84%D8%AD%D8%A9_%D9%84%D9%84%D8%A3%D9%83%D9%84 (ID: https://ar.wikipedia.org/wiki/%D8%AA%D8%B5%D9%86%D9%8A%D9%81:%D8%AB%D9%85%D8%A7%D8%B1_%D8%B5%D8%A7%D9%84%D8%AD%D8%A9_%D9%84%D9%84%D8%A3%D9%83%D9%84)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://az.wikipedia.org/wiki/Kateqoriya:Yem%C9%99li_meyv%C9%99l%C9%99r (ID: https://az.wikipedia.org/wiki/Kateqoriya:Yem%C9%99li_meyv%C9%99l%C9%99r)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://be-tarask.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D1%8D%D0%B3%D0%BE%D1%80%D1%8B%D1%8F:%D0%AF%D0%B4%D0%BE%D0%BC%D1%8B%D1%8F_%D0%BF%D0%BB%D0%B0%D0%B4%D1%8B (ID: https://be-tarask.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D1%8D%D0%B3%D0%BE%D1%80%D1%8B%D1%8F:%D0%AF%D0%B4%D0%BE%D0%BC%D1%8B%D1%8F_%D0%BF%D0%BB%D0%B0%D0%B4%D1%8B)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://bg.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%AF%D0%B4%D0%BB%D0%B8%D0%B2%D0%B8_%D0%BF%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D0%B5 (ID: https://bg.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%AF%D0%B4%D0%BB%D0%B8%D0%B2%D0%B8_%D0%BF%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D0%B5)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://bh.wikipedia.org/wiki/%E0%A4%B6%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%A3%E0%A5%80:%E0%A4%96%E0%A4%BE%E0%A4%AF%E0%A5%87_%E0%A4%9C%E0%A5%8B%E0%A4%97_%E0%A4%AB%E0%A4%B2 (ID: https://bh.wikipedia.org/wiki/%E0%A4%B6%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%A3%E0%A5%80:%E0%A4%96%E0%A4%BE%E0%A4%AF%E0%A5%87_%E0%A4%9C%E0%A5%8B%E0%A4%97_%E0%A4%AB%E0%A4%B2)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://bn.wikipedia.org/wiki/%E0%A6%AC%E0%A6%BF%E0%A6%B7%E0%A6%AF%E0%A6%BC%E0%A6%B6%E0%A7%8D%E0%A6%B0%E0%A7%87%E0%A6%A3%E0%A7%80:%E0%A6%AD%E0%A7%8B%E0%A6%9C%E0%A7%8D%E0%A6%AF_%E0%A6%AB%E0%A6%B2 (ID: https://bn.wikipedia.org/wiki/%E0%A6%AC%E0%A6%BF%E0%A6%B7%E0%A6%AF%E0%A6%BC%E0%A6%B6%E0%A7%8D%E0%A6%B0%E0%A7%87%E0%A6%A3%E0%A7%80:%E0%A6%AD%E0%A7%8B%E0%A6%9C%E0%A7%8D%E0%A6%AF_%E0%A6%AB%E0%A6%B2)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://commons.wikimedia.org/wiki/Category:Fruit_as_food (ID: https://commons.wikimedia.org/wiki/Category:Fruit_as_food)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://el.wikipedia.org/wiki/%CE%9A%CE%B1%CF%84%CE%B7%CE%B3%CE%BF%CF%81%CE%AF%CE%B1:%CE%95%CE%B4%CF%8E%CE%B4%CE%B9%CE%BC%CE%B1_%CF%86%CF%81%CE%BF%CF%8D%CF%84%CE%B1 (ID: https://el.wikipedia.org/wiki/%CE%9A%CE%B1%CF%84%CE%B7%CE%B3%CE%BF%CF%81%CE%AF%CE%B1:%CE%95%CE%B4%CF%8E%CE%B4%CE%B9%CE%BC%CE%B1_%CF%86%CF%81%CE%BF%CF%8D%CF%84%CE%B1)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://en.wikipedia.org/wiki/Category:Edible_fruits (ID: https://en.wikipedia.org/wiki/Category:Edible_fruits)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://eo.wikipedia.org/wiki/Kategorio:Man%C4%9Deblaj_fruktoj (ID: https://eo.wikipedia.org/wiki/Kategorio:Man%C4%9Deblaj_fruktoj)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://eu.wikipedia.org/wiki/Kategoria:Fruta_jangarriak (ID: https://eu.wikipedia.org/wiki/Kategoria:Fruta_jangarriak)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://fa.wikipedia.org/wiki/%D8%B1%D8%AF%D9%87:%D9%85%DB%8C%D9%88%D9%87%E2%80%8C%D9%87%D8%A7%DB%8C_%D8%AE%D9%88%D8%B1%D8%A7%DA%A9%DB%8C (ID: https://fa.wikipedia.org/wiki/%D8%B1%D8%AF%D9%87:%D9%85%DB%8C%D9%88%D9%87%E2%80%8C%D9%87%D8%A7%DB%8C_%D8%AE%D9%88%D8%B1%D8%A7%DA%A9%DB%8C)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ga.wikipedia.org/wiki/Catag%C3%B3ir:Tortha%C3%AD_inite (ID: https://ga.wikipedia.org/wiki/Catag%C3%B3ir:Tortha%C3%AD_inite)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://he.wikipedia.org/wiki/%D7%A7%D7%98%D7%92%D7%95%D7%A8%D7%99%D7%94:%D7%A4%D7%99%D7%A8%D7%95%D7%AA_%D7%9E%D7%90%D7%9B%D7%9C (ID: https://he.wikipedia.org/wiki/%D7%A7%D7%98%D7%92%D7%95%D7%A8%D7%99%D7%94:%D7%A4%D7%99%D7%A8%D7%95%D7%AA_%D7%9E%D7%90%D7%9B%D7%9C)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://hi.wikipedia.org/wiki/%E0%A4%B6%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%A3%E0%A5%80:%E0%A4%96%E0%A4%BE%E0%A4%A6%E0%A5%8D%E0%A4%AF_%E0%A4%AB%E0%A4%B2 (ID: https://hi.wikipedia.org/wiki/%E0%A4%B6%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%A3%E0%A5%80:%E0%A4%96%E0%A4%BE%E0%A4%A6%E0%A5%8D%E0%A4%AF_%E0%A4%AB%E0%A4%B2)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://id.wikipedia.org/wiki/Kategori:Buah_yang_dapat_dimakan (ID: https://id.wikipedia.org/wiki/Kategori:Buah_yang_dapat_dimakan)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ko.wikipedia.org/wiki/%EB%B6%84%EB%A5%98:%EA%B3%BC%EC%9D%BC (ID: https://ko.wikipedia.org/wiki/%EB%B6%84%EB%A5%98:%EA%B3%BC%EC%9D%BC)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://myv.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%AF%D1%80%D1%81%D0%B0%D0%BC%D0%BE_%D0%BC%D0%B0%D1%80%D1%82%D1%8C (ID: https://myv.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%AF%D1%80%D1%81%D0%B0%D0%BC%D0%BE_%D0%BC%D0%B0%D1%80%D1%82%D1%8C)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://pl.wikipedia.org/wiki/Kategoria:Owoce_jadalne (ID: https://pl.wikipedia.org/wiki/Kategoria:Owoce_jadalne)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ro.wikipedia.org/wiki/Categorie:Fructe_comestibile (ID: https://ro.wikipedia.org/wiki/Categorie:Fructe_comestibile)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://sco.wikipedia.org/wiki/Category:Edible_fruits (ID: https://sco.wikipedia.org/wiki/Category:Edible_fruits)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://tr.wikipedia.org/wiki/Kategori:Yenilebilir_meyve (ID: https://tr.wikipedia.org/wiki/Kategori:Yenilebilir_meyve)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://uk.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D1%96%D1%8F:%D0%87%D1%81%D1%82%D1%96%D0%B2%D0%BD%D1%96_%D0%BF%D0%BB%D0%BE%D0%B4%D0%B8 (ID: https://uk.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D1%96%D1%8F:%D0%87%D1%81%D1%82%D1%96%D0%B2%D0%BD%D1%96_%D0%BF%D0%BB%D0%BE%D0%B4%D0%B8)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ur.wikipedia.org/wiki/%D8%B2%D9%85%D8%B1%DB%81:%D8%AE%D9%88%D8%B1%D8%AF%D9%86%DB%8C_%D9%BE%DA%BE%D9%84 (ID: https://ur.wikipedia.org/wiki/%D8%B2%D9%85%D8%B1%DB%81:%D8%AE%D9%88%D8%B1%D8%AF%D9%86%DB%8C_%D9%BE%DA%BE%D9%84)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://vi.wikipedia.org/wiki/Th%E1%BB%83_lo%E1%BA%A1i:Qu%E1%BA%A3_%C4%83n_%C4%91%C6%B0%E1%BB%A3c (ID: https://vi.wikipedia.org/wiki/Th%E1%BB%83_lo%E1%BA%A1i:Qu%E1%BA%A3_%C4%83n_%C4%91%C6%B0%E1%BB%A3c)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://zh.wikipedia.org/wiki/Category:%E5%8F%AF%E9%A3%9F%E7%94%A8%E6%B0%B4%E6%9E%9C (ID: https://zh.wikipedia.org/wiki/Category:%E5%8F%AF%E9%A3%9F%E7%94%A8%E6%B0%B4%E6%9E%9C)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://es.wikipedia.org/wiki/Categor%C3%ADa:Frutas_comestibles (ID: https://es.wikipedia.org/wiki/Categor%C3%ADa:Frutas_comestibles)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://mk.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%98%D0%B0:%D0%88%D0%B0%D0%B4%D0%BB%D0%B8%D0%B2%D0%B8_%D0%BF%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D0%B8 (ID: https://mk.wikipedia.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%98%D0%B0:%D0%88%D0%B0%D0%B4%D0%BB%D0%B8%D0%B2%D0%B8_%D0%BF%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D0%B8)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://fi.wikipedia.org/wiki/Luokka:Sy%C3%B6t%C3%A4v%C3%A4t_hedelm%C3%A4t (ID: https://fi.wikipedia.org/wiki/Luokka:Sy%C3%B6t%C3%A4v%C3%A4t_hedelm%C3%A4t)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ml.wikipedia.org/wiki/%E0%B4%B5%E0%B5%BC%E0%B4%97%E0%B5%8D%E0%B4%97%E0%B4%82:%E0%B4%AD%E0%B4%95%E0%B5%8D%E0%B4%B7%E0%B5%8D%E0%B4%AF%E0%B4%AF%E0%B5%8B%E0%B4%97%E0%B5%8D%E0%B4%AF%E0%B4%AE%E0%B4%BE%E0%B4%AF_%E0%B4%AA%E0%B4%B4%E0%B4%99%E0%B5%8D%E0%B4%99%E0%B5%BE (ID: https://ml.wikipedia.org/wiki/%E0%B4%B5%E0%B5%BC%E0%B4%97%E0%B5%8D%E0%B4%97%E0%B4%82:%E0%B4%AD%E0%B4%95%E0%B5%8D%E0%B4%B7%E0%B5%8D%E0%B4%AF%E0%B4%AF%E0%B5%8B%E0%B4%97%E0%B5%8D%E0%B4%AF%E0%B4%AE%E0%B4%BE%E0%B4%AF_%E0%B4%AA%E0%B4%B4%E0%B4%99%E0%B5%8D%E0%B4%99%E0%B5%BE)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://my.wikipedia.org/wiki/%E1%80%80%E1%80%8F%E1%80%B9%E1%80%8D:%E1%80%85%E1%80%AC%E1%80%B8%E1%80%94%E1%80%AD%E1%80%AF%E1%80%84%E1%80%BA%E1%80%9E%E1%80%B1%E1%80%AC_%E1%80%9E%E1%80%85%E1%80%BA%E1%80%9E%E1%80%AE%E1%80%B8%E1%80%99%E1%80%BB%E1%80%AC%E1%80%B8 (ID: https://my.wikipedia.org/wiki/%E1%80%80%E1%80%8F%E1%80%B9%E1%80%8D:%E1%80%85%E1%80%AC%E1%80%B8%E1%80%94%E1%80%AD%E1%80%AF%E1%80%84%E1%80%BA%E1%80%9E%E1%80%B1%E1%80%AC_%E1%80%9E%E1%80%85%E1%80%BA%E1%80%9E%E1%80%AE%E1%80%B8%E1%80%99%E1%80%BB%E1%80%AC%E1%80%B8)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: https://ka.wikipedia.org/wiki/%E1%83%99%E1%83%90%E1%83%A2%E1%83%94%E1%83%92%E1%83%9D%E1%83%A0%E1%83%98%E1%83%90:%E1%83%A1%E1%83%90%E1%83%AD%E1%83%9B%E1%83%94%E1%83%9A%E1%83%90%E1%83%93_%E1%83%95%E1%83%90%E1%83%A0%E1%83%92%E1%83%98%E1%83%A1%E1%83%98_%E1%83%AE%E1%83%98%E1%83%9A%E1%83%98 (ID: https://ka.wikipedia.org/wiki/%E1%83%99%E1%83%90%E1%83%A2%E1%83%94%E1%83%92%E1%83%9D%E1%83%A0%E1%83%98%E1%83%90:%E1%83%A1%E1%83%90%E1%83%AD%E1%83%9B%E1%83%94%E1%83%9A%E1%83%90%E1%83%93_%E1%83%95%E1%83%90%E1%83%A0%E1%83%92%E1%83%98%E1%83%A1%E1%83%98_%E1%83%AE%E1%83%98%E1%83%9A%E1%83%98)\n",
      "Property: http://schema.org/about (ID: http://schema.org/about)\n",
      "---\n",
      "Entity: list of culinary fruits (ID: http://www.wikidata.org/entity/Q497975)\n",
      "Property: http://www.wikidata.org/prop/direct/P910 (ID: http://www.wikidata.org/prop/direct/P910)\n",
      "---\n",
      "Entity: Q32657391 (ID: http://www.wikidata.org/entity/Q32657391)\n",
      "Property: http://www.w3.org/2002/07/owl#sameAs (ID: http://www.w3.org/2002/07/owl#sameAs)\n",
      "---\n",
      "Entity: Q33081629 (ID: http://www.wikidata.org/entity/Q33081629)\n",
      "Property: http://www.w3.org/2002/07/owl#sameAs (ID: http://www.w3.org/2002/07/owl#sameAs)\n",
      "---\n",
      "Entity: http://www.wikidata.org/reference/1443cbd163fb05850b2f4fa8509e354e0158baea (ID: http://www.wikidata.org/reference/1443cbd163fb05850b2f4fa8509e354e0158baea)\n",
      "Property: http://www.wikidata.org/prop/reference/P3452 (ID: http://www.wikidata.org/prop/reference/P3452)\n",
      "---\n"
     ]
    }
   ],
   "source": [
    "query_string = \"\"\"\n",
    "SELECT ?WDid ?WDidLabel ?property ?propertyLabel\n",
    "WHERE {\n",
    "  ?WDid ?property wd:Q15254139.  # Any property pointing to Q15254139\n",
    "  SERVICE wikibase:label {       # Fetch labels for entities and properties\n",
    "    bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n",
    "  }\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "results = return_sparql_query_results(query_string)\n",
    "for result in results['results']['bindings']:\n",
    "    print(f\"Entity: {result['WDidLabel']['value']} (ID: {result['WDid']['value']})\")\n",
    "    print(f\"Property: {result['propertyLabel']['value']} (ID: {result['property']['value']})\")\n",
    "    print(\"---\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "69770\n"
     ]
    }
   ],
   "source": [
    "from qwikidata.sparql import return_sparql_query_results\n",
    "\n",
    "query_string = '''\n",
    "SELECT ?WDid ?EPPOCode\n",
    "WHERE {\n",
    "  ?WDid wdt:P3031 ?EPPOCode.  # Has a EPPO ID\n",
    "}\n",
    "'''\n",
    "\n",
    "results = return_sparql_query_results(query_string)\n",
    "print(len(results['results']['bindings']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "results['results']['bindings']\n",
    "\n",
    "EPPOCodes = []\n",
    "\n",
    "for result in results['results']['bindings']:\n",
    "    EPPOCodes.append(result['EPPOCode']['value'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17911\n"
     ]
    }
   ],
   "source": [
    "code1 = []\n",
    "\n",
    "for code in EPPOCodes:\n",
    "    if code.startswith('1'):\n",
    "        code1.append(code)\n",
    "        \n",
    "print(len(code1)) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "EPPOCodes = list(set(EPPOCodes))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_EPPO = pd.read_parquet('/workdir/EPPO Dataframes/df.plants.scraped.sorted.gzip',engine='fastparquet')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "db_EPPOCodes = list(df_EPPO['EPPO Code'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "16 : CIDSS\n",
      "23 : CIDLO\n",
      "25 : CIDNO\n",
      "34 : CIDHX\n",
      "43 : CIDMY\n",
      "46 : CIDSW\n",
      "58 : CIDSP\n",
      "60 : CIDPE\n",
      "62 : CIDAY\n",
      "64 : CIDLC\n",
      "66 : CIDRX\n",
      "73 : CIDHL\n",
      "82 : ROSSS\n",
      "113 : PIUSS\n",
      "140 : PIUTA\n",
      "144 : PRNSS\n",
      "179 : PIUDO\n",
      "188 : PIUTC\n",
      "204 : PIUPM\n",
      "208 : PIUCU\n",
      "209 : PIUDN\n",
      "213 : PIUKK\n",
      "218 : PIURU\n",
      "223 : PIUSO\n",
      "224 : PIUBM\n",
      "228 : PIUBP\n",
      "230 : PIUHR\n",
      "232 : PIUEE\n",
      "238 : PIUTM\n",
      "247 : PIUKL\n",
      "256 : MUBSS\n",
      "267 : COFSS\n",
      "270 : GOSSS\n",
      "292 : COFST\n",
      "293 : COFEX\n",
      "308 : COFHY\n",
      "309 : COFKA\n",
      "311 : COFEU\n",
      "323 : MUBTR\n",
      "344 : ROSHY\n",
      "352 : ROSID\n",
      "362 : ROSOP\n",
      "380 : RUBSS\n",
      "386 : PRNIA\n",
      "391 : PRNOT\n",
      "393 : PRNAS\n",
      "400 : PRNAY\n",
      "403 : PRNHY\n",
      "410 : ROSXX\n",
      "413 : PRNFM\n",
      "418 : PRNLS\n",
      "422 : PRNCG\n",
      "423 : PRNPH\n",
      "428 : PRNPQ\n",
      "436 : PRNHL\n",
      "439 : PRNCU\n",
      "442 : PRNZB\n",
      "450 : QUESS\n",
      "455 : GOSTU\n",
      "460 : PYUSS\n",
      "467 : MABSS\n",
      "468 : SAXSS\n",
      "474 : BRSSS\n",
      "479 : CUUSS\n",
      "505 : SOLMQ\n",
      "518 : SOLTH\n",
      "519 : BRSOH\n",
      "533 : PIEJJ\n",
      "534 : SOLVL\n",
      "536 : EUCSS\n",
      "539 : SOLOX\n",
      "557 : SOLVC\n",
      "560 : CUUMZ\n",
      "561 : SOLRP\n",
      "568 : PIEJH\n",
      "571 : PIEKR\n",
      "578 : SOLTL\n",
      "584 : POPSS\n",
      "589 : SOLXN\n",
      "593 : SOLSS\n",
      "612 : CUUPG\n",
      "615 : SOLVR\n",
      "619 : SOLAI\n",
      "621 : CUUCY\n",
      "623 : CUUOK\n",
      "629 : SOLDO\n",
      "636 : CUULU\n",
      "643 : SOLBR\n",
      "644 : SOLBE\n",
      "648 : CUURA\n",
      "654 : CUUPA\n",
      "655 : CUUPD\n",
      "659 : SOLPU\n",
      "662 : VACSS\n",
      "669 : PIESS\n",
      "674 : PIEMX\n",
      "678 : SOLBV\n",
      "683 : MABMO\n",
      "684 : SOLHI\n",
      "690 : SOLSV\n",
      "696 : SOLNU\n",
      "704 : SOLMO\n",
      "708 : SOLMT\n",
      "709 : SOLTF\n",
      "711 : PIEST\n",
      "713 : SOLTW\n",
      "715 : SOLTI\n",
      "716 : CUUHY\n",
      "717 : SOLVS\n",
      "718 : SOLZU\n",
      "719 : SOLVM\n",
      "721 : SOLQA\n",
      "722 : SOLQO\n",
      "724 : SOLRD\n",
      "725 : SOLDP\n",
      "726 : SOLZR\n",
      "729 : SOLDB\n",
      "730 : SOLRG\n",
      "740 : ULMSS\n",
      "742 : ABIBR\n",
      "744 : SOLPQ\n",
      "747 : SOLSK\n",
      "749 : PYUHY\n",
      "751 : PYULE\n",
      "752 : PYUHO\n",
      "754 : FOLSS\n",
      "759 : CSCSS\n",
      "762 : SOLFZ\n",
      "764 : SOLGO\n",
      "774 : ABISS\n",
      "776 : PYUAR\n",
      "781 : VACHY\n",
      "790 : SOLDA\n",
      "798 : LAXPR\n",
      "823 : PYUSK\n",
      "825 : ABIHY\n",
      "834 : EUCPQ\n",
      "840 : EUCHY\n",
      "849 : HIBSS\n",
      "863 : LAXSS\n",
      "878 : CHEGI\n",
      "903 : EUCFG\n",
      "904 : EUCPJ\n",
      "908 : EUCKI\n",
      "912 : MORSS\n",
      "913 : EUCLG\n",
      "916 : EUCCT\n",
      "919 : EUCDG\n",
      "920 : CUMMC\n",
      "921 : EUCMT\n",
      "923 : MTLSS\n",
      "927 : VITSS\n",
      "932 : MOMTR\n",
      "934 : ARCSS\n",
      "935 : ERYHY\n",
      "938 : LAXLU\n",
      "944 : CJCWE\n",
      "952 : QUEST\n",
      "959 : KEDLE\n",
      "962 : LUFSS\n",
      "967 : EUCZZ\n",
      "970 : CUMSS\n",
      "971 : EUCMB\n",
      "972 : EUCLX\n",
      "976 : EUCLN\n",
      "979 : EUCVV\n",
      "981 : EUCMJ\n",
      "983 : EUCAF\n",
      "984 : EUCUG\n",
      "989 : RORSS\n",
      "993 : EUCMM\n",
      "1000 : EUCEX\n",
      "1003 : EUCFO\n",
      "1005 : RUBHY\n",
      "1009 : RUBHP\n",
      "1014 : EUCDJ\n",
      "1015 : VACTE\n",
      "1019 : CQCEL\n",
      "1026 : VACRC\n",
      "1028 : EUCBS\n",
      "1029 : ZRTGR\n",
      "1030 : LEPSS\n",
      "1031 : EUCKO\n",
      "1034 : SEXLA\n",
      "1035 : QUEMX\n",
      "1036 : SSYSS\n",
      "1042 : LGNSP\n",
      "1043 : EUCGX\n",
      "1044 : EUCKT\n",
      "1048 : VELSS\n",
      "1055 : IUMMA\n",
      "1056 : BARSS\n",
      "1060 : CUMFF\n",
      "1062 : EUCPY\n",
      "1066 : ARBSS\n",
      "1070 : CUMAF\n",
      "1073 : MOMRO\n",
      "1074 : MOMTU\n",
      "1075 : CUMAC\n",
      "1081 : HISSS\n",
      "1083 : EUCRD\n",
      "1086 : NAASS\n",
      "1089 : EUCOC\n",
      "1096 : COCTR\n",
      "1099 : LEUSS\n",
      "1105 : SEHTA\n",
      "1108 : EUCRA\n",
      "1113 : CQBAS\n",
      "1115 : ZEHOD\n",
      "1116 : GPTCO\n",
      "1119 : ZEHWA\n",
      "1121 : RUBAE\n",
      "1122 : CSCCC\n",
      "1126 : CSCPI\n",
      "1129 : EUCAN\n",
      "1133 : POPHY\n",
      "1134 : KEDFO\n",
      "1137 : ARWSS\n",
      "1141 : QUERG\n",
      "1146 : CYIRA\n",
      "1147 : CYIAM\n",
      "1148 : EUCCH\n",
      "1151 : MEESC\n",
      "1152 : CQCSC\n",
      "1166 : COCMI\n",
      "1169 : COCQU\n",
      "1171 : MBHFA\n",
      "1178 : TTHTR\n",
      "1189 : MOMCL\n",
      "1206 : RUBNG\n",
      "1211 : LGNSS\n",
      "1215 : QUEGT\n",
      "1217 : EUCLC\n",
      "1218 : EUCNA\n",
      "1222 : QUELR\n",
      "1224 : QUEHU\n",
      "1226 : RIBSS\n",
      "1230 : QUEIR\n",
      "1232 : QUEHH\n",
      "1235 : QUEBK\n",
      "1236 : CSCWI\n",
      "1240 : POPDA\n",
      "1242 : CSCGR\n",
      "1244 : QUEGV\n",
      "1253 : CSCMX\n",
      "1262 : QUELK\n",
      "1264 : QUEIV\n",
      "1265 : QUEDY\n",
      "1269 : QUELL\n",
      "1272 : POPBR\n",
      "1278 : QUESF\n",
      "1279 : QUESE\n",
      "1280 : POPXI\n",
      "1282 : RUBLH\n",
      "1286 : RUBRZ\n",
      "1288 : ACRSS\n",
      "1294 : QUESJ\n",
      "1296 : RUBDS\n",
      "1308 : QUESN\n",
      "1313 : RUBZM\n",
      "1316 : RUBTY\n",
      "1333 : CSCMT\n",
      "1337 : FRXSS\n",
      "1343 : CSCPR\n",
      "1345 : SAXRC\n",
      "1347 : RUBVA\n",
      "1348 : RUBAT\n",
      "1349 : RUBER\n",
      "1350 : BETSS\n",
      "1358 : CJCPT\n",
      "1361 : POPMX\n",
      "1369 : SAXEW\n",
      "1377 : FIUSS\n",
      "1392 : TRFSS\n",
      "1403 : RHOSS\n",
      "1407 : ALLAS\n",
      "1418 : ULMHY\n",
      "1428 : ACASS\n",
      "1431 : PELSS\n",
      "1432 : PEUSS\n",
      "1433 : CPSSS\n",
      "1453 : NIOBI\n",
      "1459 : HIBAT\n",
      "1475 : TRZTI\n",
      "1480 : TRZSS\n",
      "1481 : RIBRC\n",
      "1483 : RIBDK\n",
      "1496 : HIBLI\n",
      "1505 : RIBSH\n",
      "1507 : TRZBA\n",
      "1521 : VITHD\n",
      "1526 : IUGSS\n",
      "1529 : ALLSS\n",
      "1538 : CPSCA\n",
      "1542 : ALLCK\n",
      "1545 : DAHSS\n",
      "1565 : ALUSS\n",
      "1566 : ALLCJ\n",
      "1568 : ALLVA\n",
      "1581 : ALLAI\n",
      "1582 : MORLA\n",
      "1585 : VITRI\n",
      "1589 : ALLGA\n",
      "1590 : GLAHY\n",
      "1595 : ALLHO\n",
      "1614 : IUPSS\n",
      "1625 : FRASS\n",
      "1626 : CHYSS\n",
      "1634 : BETPS\n",
      "1660 : NIOSS\n",
      "1669 : PHYSS\n",
      "1674 : AMASS\n",
      "1689 : IUPSV\n",
      "1700 : DIFSS\n",
      "1712 : IUPCC\n",
      "1713 : IUPDP\n",
      "1732 : TRFCY\n",
      "1743 : TSUSS\n",
      "1751 : LYUSS\n",
      "1761 : RHOLH\n",
      "1764 : IUPME\n",
      "1769 : RHOHY\n",
      "1775 : DAHHY\n",
      "1792 : GLASS\n",
      "1794 : NIOED\n",
      "1811 : NIOMI\n",
      "1822 : CTTSS\n",
      "1823 : FIUPL\n",
      "1828 : NIOCO\n",
      "1829 : NIOEC\n",
      "1830 : IUGSI\n",
      "1831 : NIONO\n",
      "1836 : NIOHE\n",
      "1837 : NIOKA\n",
      "1839 : NIOLI\n",
      "1840 : NIOKN\n",
      "1843 : NIOBN\n",
      "1855 : ACRPU\n",
      "1870 : NIOAR\n",
      "1871 : IUGAU\n",
      "1873 : NIOOP\n",
      "1874 : NIOTH\n",
      "1875 : NIOPC\n",
      "1877 : DATSS\n",
      "1878 : FIUBF\n",
      "1884 : ALUFO\n",
      "1894 : FIUPN\n",
      "1896 : FIURA\n",
      "1903 : LYUCA\n",
      "1906 : NIOPE\n",
      "1909 : NIORI\n",
      "1911 : NIORT\n",
      "1912 : NIOSO\n",
      "1913 : NIOST\n",
      "1919 : NIOUN\n",
      "1923 : PEUHG\n",
      "1924 : PEUAP\n",
      "1926 : PELGA\n",
      "1928 : SOUSS\n",
      "1933 : ACAFO\n",
      "1942 : PLTSS\n",
      "1950 : PIOSS\n",
      "1962 : FIUSE\n",
      "1965 : ACAOH\n",
      "1968 : SAMSS\n",
      "1973 : BEGSS\n",
      "1974 : FIUMN\n",
      "1976 : PELAU\n",
      "1978 : FIUHK\n",
      "1979 : PELCI\n",
      "1980 : IUGAC\n",
      "1989 : BEAVV\n",
      "1990 : VIBSS\n",
      "1992 : FIULE\n",
      "1995 : FIULP\n",
      "2000 : MAGSS\n",
      "2004 : PHYVR\n",
      "2006 : FIUPT\n",
      "2008 : FIUVR\n",
      "2017 : MLPEM\n",
      "2029 : ACRPS\n",
      "2030 : FIUPI\n",
      "2036 : FIUGM\n",
      "2038 : FIUCH\n",
      "2040 : BGMHY\n",
      "2042 : ACAKS\n",
      "2043 : BGMSS\n",
      "2047 : FIUOP\n",
      "2051 : HELSS\n",
      "2053 : FIUOB\n",
      "2055 : CAHSS\n",
      "2057 : VITCA\n",
      "2070 : ACARR\n",
      "2074 : FIUCI\n",
      "2075 : HEBSS\n",
      "2078 : ACAHL\n",
      "2080 : XATSS\n",
      "2081 : ACAIG\n",
      "2082 : ALUFM\n",
      "2083 : FIUMU\n",
      "2084 : VITCH\n",
      "2090 : CHESS\n",
      "2093 : MAGPA\n",
      "2100 : MAGSH\n",
      "2102 : FIUPP\n",
      "2104 : MAGFO\n",
      "2105 : MAGGU\n",
      "2106 : MAGHO\n",
      "2117 : MAGAM\n",
      "2118 : FRACC\n",
      "2122 : VITFL\n",
      "2126 : ALDAM\n",
      "2139 : PIOPA\n",
      "2140 : ALDES\n",
      "2141 : PIOMI\n",
      "2148 : PIOHA\n",
      "2149 : LYUTU\n",
      "2150 : PYESS\n",
      "2151 : DIUSS\n",
      "2152 : LIGSS\n",
      "2158 : OPUSS\n",
      "2163 : PAQSS\n",
      "2173 : PIOSA\n",
      "2175 : MAGTA\n",
      "2179 : FRAVB\n",
      "2185 : MAGYU\n",
      "2189 : BEGKH\n",
      "2192 : IUGHR\n",
      "2194 : ZNTSS\n",
      "2198 : CEMSS\n",
      "2199 : GLAGD\n",
      "2201 : BAMSS\n",
      "2207 : PIOGI\n",
      "2216 : ZNTOD\n",
      "2218 : GLAGA\n",
      "2220 : ZNTAA\n",
      "2222 : CAHSE\n",
      "2225 : SYNSS\n",
      "2226 : VITDO\n",
      "2228 : VITCN\n",
      "2229 : VITBQ\n",
      "2234 : ALDWE\n",
      "2238 : PLTMX\n",
      "2240 : BEGHY\n",
      "2245 : VITHE\n",
      "2246 : CXSSS\n",
      "2249 : CLFBH\n",
      "2252 : CLFSS\n",
      "2261 : VITSW\n",
      "2264 : VITPE\n",
      "2282 : CEUSS\n",
      "2287 : MAGKA\n",
      "2290 : BOUSS\n",
      "2292 : ASTSS\n",
      "2297 : SZTSS\n",
      "2299 : VIBRH\n",
      "2306 : VIBHI\n",
      "2317 : AURSS\n",
      "2322 : AGLSS\n",
      "2328 : VEBHY\n",
      "2332 : ASPSS\n",
      "2333 : SORSS\n",
      "2337 : MALSS\n",
      "2342 : CRWSS\n",
      "2345 : RUMSS\n",
      "2353 : TAGSS\n",
      "2354 : ATFSI\n",
      "2357 : TQWSP\n",
      "2364 : BEGSH\n",
      "2369 : ZIISS\n",
      "2378 : GLADA\n",
      "2383 : SZTWI\n",
      "2394 : BRFLA\n",
      "2398 : ABGPL\n",
      "2404 : CYLSS\n",
      "2412 : PAQPD\n",
      "2413 : PAQPN\n",
      "2418 : OXASS\n",
      "2421 : PAQSF\n",
      "2429 : IPOSS\n",
      "2431 : CVBSS\n",
      "2443 : AURHO\n",
      "2444 : PHSPU\n",
      "2445 : NICSS\n",
      "2447 : AOULU\n",
      "2451 : PAQAU\n",
      "2453 : PAQAR\n",
      "2454 : AOUTA\n",
      "2456 : HSYDE\n",
      "2457 : IRIHO\n",
      "2461 : NIESS\n",
      "2462 : HSYSS\n",
      "2463 : BRWVI\n",
      "2465 : CAHIN\n",
      "2470 : CAHRO\n",
      "2471 : JALCO\n",
      "2474 : CAHHI\n",
      "2476 : CAHGJ\n",
      "2477 : CAHDR\n",
      "2478 : CAHCH\n",
      "2493 : TILSS\n"
     ]
    }
   ],
   "source": [
    "check = 0\n",
    "\n",
    "for i, code in enumerate(db_EPPOCodes):\n",
    "    if code not in EPPOCodes:\n",
    "        print(i, ':' , code)\n",
    "        check += 1\n",
    "    if check > 500:\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_string = '''\n",
    "SELECT ?WDid ?GBIFCode\n",
    "WHERE {\n",
    "  ?WDid wdt:P105 wd:Q7432.  # Taxon rank is species\n",
    "  ?WDid wdt:P3031 ?EPPOCode.  # Has a EPPO taxon ID\n",
    "}\n",
    "'''\n",
    "\n",
    "results = return_sparql_query_results(query_string)\n",
    "print(len(results['results']['bindings']))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3312808"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(results['results']['bindings'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "157701it [00:43, 3634.10it/s]\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[7], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m i, entity_dict \u001b[38;5;129;01min\u001b[39;00m tqdm(\u001b[38;5;28menumerate\u001b[39m(wjd)):\n\u001b[1;32m      2\u001b[0m     \u001b[38;5;66;03m# print(list(entity_dict.keys()))\u001b[39;00m\n\u001b[1;32m      3\u001b[0m     \u001b[38;5;66;03m# print(list(entity_dict['claims'].keys()))\u001b[39;00m\n\u001b[1;32m      4\u001b[0m     \u001b[38;5;66;03m# pprint(entity_dict)\u001b[39;00m\n\u001b[1;32m      5\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m entity_dict[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mid\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;241m.\u001b[39mstartswith(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mP\u001b[39m\u001b[38;5;124m'\u001b[39m):\n\u001b[1;32m      6\u001b[0m         found \u001b[38;5;241m=\u001b[39m entity_dict\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/site-packages/tqdm/std.py:1195\u001b[0m, in \u001b[0;36mtqdm.__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1192\u001b[0m time \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_time\n\u001b[1;32m   1194\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m-> 1195\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m obj \u001b[38;5;129;01min\u001b[39;00m iterable:\n\u001b[1;32m   1196\u001b[0m         \u001b[38;5;28;01myield\u001b[39;00m obj\n\u001b[1;32m   1197\u001b[0m         \u001b[38;5;66;03m# Update and possibly print the progressbar.\u001b[39;00m\n\u001b[1;32m   1198\u001b[0m         \u001b[38;5;66;03m# Note: does not call self.update(1) for speed optimisation.\u001b[39;00m\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/site-packages/qwikidata/json_dump.py:72\u001b[0m, in \u001b[0;36mWikidataJsonDump.__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     70\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m__iter__\u001b[39m(\u001b[38;5;28mself\u001b[39m) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m Iterator[Dict]:\n\u001b[1;32m     71\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\"Iterate over lines in the file.\"\"\"\u001b[39;00m\n\u001b[0;32m---> 72\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m line_str \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39miter_lines():\n\u001b[1;32m     73\u001b[0m         line_str \u001b[38;5;241m=\u001b[39m line_str\u001b[38;5;241m.\u001b[39mrstrip(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m,\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     74\u001b[0m         \u001b[38;5;66;03m# first and last lines are opening and closing brackets\u001b[39;00m\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/site-packages/qwikidata/json_dump.py:67\u001b[0m, in \u001b[0;36mWikidataJsonDump.iter_lines\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     65\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"Generate lines from JSON dump file.\"\"\"\u001b[39;00m\n\u001b[1;32m     66\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_open_dump_file() \u001b[38;5;28;01mas\u001b[39;00m fp:\n\u001b[0;32m---> 67\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m linebytes \u001b[38;5;129;01min\u001b[39;00m fp:\n\u001b[1;32m     68\u001b[0m         \u001b[38;5;28;01myield\u001b[39;00m linebytes\u001b[38;5;241m.\u001b[39mdecode(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mutf-8\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/gzip.py:398\u001b[0m, in \u001b[0;36mGzipFile.readline\u001b[0;34m(self, size)\u001b[0m\n\u001b[1;32m    396\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mreadline\u001b[39m(\u001b[38;5;28mself\u001b[39m, size\u001b[38;5;241m=\u001b[39m\u001b[38;5;241m-\u001b[39m\u001b[38;5;241m1\u001b[39m):\n\u001b[1;32m    397\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_check_not_closed()\n\u001b[0;32m--> 398\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mreadline\u001b[49m\u001b[43m(\u001b[49m\u001b[43msize\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/_compression.py:68\u001b[0m, in \u001b[0;36mDecompressReader.readinto\u001b[0;34m(self, b)\u001b[0m\n\u001b[1;32m     66\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mreadinto\u001b[39m(\u001b[38;5;28mself\u001b[39m, b):\n\u001b[1;32m     67\u001b[0m     \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mmemoryview\u001b[39m(b) \u001b[38;5;28;01mas\u001b[39;00m view, view\u001b[38;5;241m.\u001b[39mcast(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mB\u001b[39m\u001b[38;5;124m\"\u001b[39m) \u001b[38;5;28;01mas\u001b[39;00m byte_view:\n\u001b[0;32m---> 68\u001b[0m         data \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mread\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mlen\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mbyte_view\u001b[49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m     69\u001b[0m         byte_view[:\u001b[38;5;28mlen\u001b[39m(data)] \u001b[38;5;241m=\u001b[39m data\n\u001b[1;32m     70\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(data)\n",
      "File \u001b[0;32m~/miniconda3/lib/python3.9/gzip.py:495\u001b[0m, in \u001b[0;36m_GzipReader.read\u001b[0;34m(self, size)\u001b[0m\n\u001b[1;32m    492\u001b[0m \u001b[38;5;66;03m# Read a chunk of data from the file\u001b[39;00m\n\u001b[1;32m    493\u001b[0m buf \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_fp\u001b[38;5;241m.\u001b[39mread(io\u001b[38;5;241m.\u001b[39mDEFAULT_BUFFER_SIZE)\n\u001b[0;32m--> 495\u001b[0m uncompress \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_decompressor\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdecompress\u001b[49m\u001b[43m(\u001b[49m\u001b[43mbuf\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43msize\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    496\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_decompressor\u001b[38;5;241m.\u001b[39munconsumed_tail \u001b[38;5;241m!=\u001b[39m \u001b[38;5;124mb\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[1;32m    497\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_fp\u001b[38;5;241m.\u001b[39mprepend(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_decompressor\u001b[38;5;241m.\u001b[39munconsumed_tail)\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "for i, entity_dict in tqdm(enumerate(wjd)):\n",
    "    # print(list(entity_dict.keys()))\n",
    "    # print(list(entity_dict['claims'].keys()))\n",
    "    # pprint(entity_dict)\n",
    "    if entity_dict['id'].startswith('P'):\n",
    "        found = entity_dict\n",
    "        break    \n",
    "    if i > 1000000:\n",
    "        print('Not found')\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "WikidataItem(label=Belgium, id=Q31, description=country in western Europe, aliases=['Kingdom of Belgium', 'BEL', 'be', '🇧🇪', 'BE'], enwiki_title=Belgium)\n",
      "WikidataItem(label=happiness, id=Q8, description=mental or emotional state of well-being characterized by pleasant emotions, aliases=['joy', 'happy', 'Happiness'], enwiki_title=Happiness)\n"
     ]
    }
   ],
   "source": [
    "from qwikidata.entity import WikidataItem, WikidataProperty\n",
    "\n",
    "type_to_entity_class = {\"item\": WikidataItem, \"property\": WikidataProperty}\n",
    "max_entities = 2\n",
    "entities = []\n",
    "\n",
    "\n",
    "for ii, entity_dict in enumerate(wjd):\n",
    "  if ii >= max_entities:\n",
    "    break\n",
    "  entity_id = entity_dict[\"id\"]\n",
    "  entity_type = entity_dict[\"type\"]\n",
    "  entity = type_to_entity_class[entity_type](entity_dict)\n",
    "  entities.append(entity)\n",
    "\n",
    "for entity in entities:\n",
    "  print(entity)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
